# PartUtils Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartUtils Class
Members See Also
---
General Part utility methods
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static class PartUtils
```

Visual Basic
---
```text
Public NotInheritable Class PartUtils
```

Visual C++
---
```text
public ref class PartUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..PartUtils
# See Also
PartUtils Members
Autodesk.Revit.DB Namespace